app/views/listings/show.html.erb

                            <%= link_to(listing) do %>
                                <%= image_tag listing.photos[0].image.url(:medium)  if listing.photos.length > 0 %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."listing_id" = ?  [["listing_id", 1]]