app/controllers/listings_controller.rb

INSERT INTO "listings" ("home_type", "pet_type", "breeding_years", "pet_size", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["home_type", "一軒家"], ["pet_type", "犬"], ["breeding_years", 1], ["pet_size", "小型"], ["user_id", 1], ["created_at", "2017-01-26 03:15:27.143363"], ["updated_at", "2017-01-26 03:15:27.143363"]]
---
  def create
    # パラメーターとともに現在のユーザーのリスティングを作成
    @listing = current_user.listings.build(listing_params)

    if @listing.save

UPDATE "listings" SET "sex" = ?, "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["sex", "男"], ["address", "山形県東町"], ["latitude", 38.908751], ["longitude", 139.8615775], ["updated_at", "2017-01-26 08:20:30.751152"], ["id", 8]]
---
  def update
    if @listing.update(listing_params)

SELECT listings.*, (69.09332411348201 * ABS(listings.latitude - 38.9147858) * 0.7071067811865475) + (59.836573914187355 * ABS(listings.longitude - 139.8365708) * 0.7071067811865475) AS distance, CASE WHEN (listings.latitude >= 38.9147858 AND listings.longitude >= 139.8365708) THEN  45.0 WHEN (listings.latitude <  38.9147858 AND listings.longitude >= 139.8365708) THEN 135.0 WHEN (listings.latitude <  38.9147858 AND listings.longitude <  139.8365708) THEN 225.0 WHEN (listings.latitude >= 38.9147858 AND listings.longitude <  139.8365708) THEN 315.0 END AS bearing FROM "listings" WHERE (listings.latitude BETWEEN 38.77005401688915 AND 39.059517583110846 AND listings.longitude BETWEEN 139.650559613366 AND 140.022581986634 AND listings.id != 1)  ORDER BY distance ASC
---
  def set_listing
    @listing = Listing.find(params[:id])